# Assignment

Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")
dataframe=pd.DataFrame({"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})

In [2]:
dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [3]:
dataframe.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [4]:
dataframe.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [5]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [6]:
dataframe.iloc[0:2]

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [7]:
dataframe.nunique()

Name      3
Age       3
Gender    2
dtype: int64

In [8]:
dataframe.append({"Name":"Rohan","Age":45,"Gender":"Male"},ignore_index=True)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
3   Rohan   45    Male

In [9]:
dataframe.mean()

Age    27.333333
dtype: float64

In [10]:
dataframe.sort_values(ascending=False,by="Age")

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alice   25  Female

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
df=pd.DataFrame({"A":["Alice","Bob","Claire","Rohan"],"B":[25,30,27,38],"C":["Female","Male","Female","Male"]})

In [13]:
df

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female
3   Rohan  38    Male

In [14]:
def reindex_df(df):
    new_index=[i for i in range(0,2*(len(df))+1) if(i%2!=0)]
       
    return df.set_index([new_index])

In [15]:
reindex_df(df)

        A   B       C
1   Alice  25  Female
3     Bob  30    Male
5  Claire  27  Female
7   Rohan  38    Male

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [16]:
df1=pd.DataFrame({"Products":["TV","Mobile","Tab","Laptop"],"Values":[50000,40000,30000,45000]})

In [17]:
df1

  Products  Values
0       TV   50000
1   Mobile   40000
2      Tab   30000
3   Laptop   45000

In [18]:
def calc_values(df):
    sum_value=0
    for i in range(3):
        sum_value=sum_value+df1["Values"][i]
    return sum_value

In [19]:
calc_values(df1)

120000

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [20]:
df2=pd.DataFrame({"Names":["Alice","Bob","Claire","Rohan"],"Text":["Good in Studies","Smart","Ambitious","Extraordinary in Computers and Mathematics"]})

In [21]:
df2

    Names                                        Text
0   Alice                             Good in Studies
1     Bob                                       Smart
2  Claire                                   Ambitious
3   Rohan  Extraordinary in Computers and Mathematics

In [22]:
def word_count(df):
    df["Word_count"]=df["Text"].str.split(" ").apply(lambda x:len(x))
    
    return df

In [23]:
word_count(df2)

    Names                                        Text  Word_count
0   Alice                             Good in Studies           3
1     Bob                                       Smart           1
2  Claire                                   Ambitious           1
3   Rohan  Extraordinary in Computers and Mathematics           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [24]:
df2.shape

(4, 3)

In [25]:
df2.size

12

DataFrame.size() denotes total number of elements present in dataframe while Dataframe.shape() denotes number of rows and columns of dataframe.

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel() used to read an excel file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [26]:
df_new=pd.DataFrame({"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Email":["alice09@example.com","yo99bob@example.com","scorer.charlie@example.com"]})

In [27]:
df_new

     Name  Age                       Email
0   Alice   25         alice09@example.com
1     Bob   30         yo99bob@example.com
2  Claire   27  scorer.charlie@example.com

In [28]:
def add_clmn(df):
    df["Username"]=df["Email"].str.split("@").str[0]
    
    return df

In [29]:
add_clmn(df_new)

     Name  Age                       Email        Username
0   Alice   25         alice09@example.com         alice09
1     Bob   30         yo99bob@example.com         yo99bob
2  Claire   27  scorer.charlie@example.com  scorer.charlie

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2


Your function should select the following rows:

A B C

1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [30]:
df_orginal=pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})

In [31]:
df_orginal

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [32]:
def modified_df(df):
    dataf=df[df["A"]>5]
    dataf[dataf["B"]<10]
    
    return dataf

In [33]:
modified_df(df_orginal)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [34]:
df1=pd.DataFrame({"Products":["TV","Mobile","Tab","Laptop"],"Values":[50000,40000,30000,45000]})

In [35]:
df1

  Products  Values
0       TV   50000
1   Mobile   40000
2      Tab   30000
3   Laptop   45000

In [36]:
def stats(df):
    mean=df["Values"].mean()
    median=df["Values"].median()
    std=df["Values"].std()
    
    return mean,median,std

In [37]:
stats(df1)

(41250.0, 42500.0, 8539.125638299665)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [38]:
df_sales=pd.DataFrame({"sales": [100, 150, 200, 175,250,300,225,210,250,300,600],
        "date": ["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04","2023-01-05","2023-01-06","2023-01-07","2023-01-08","2023-01-09","2023-01-10","2023-01-11"]})

In [39]:
def moving_avg(df):
    df["MovingAverage"]=df.rolling(window=7,min_periods=1).mean()
    
    return df

In [40]:
moving_avg(df_sales)

    sales        date  MovingAverage
0     100  2023-01-01     100.000000
1     150  2023-01-02     125.000000
2     200  2023-01-03     150.000000
3     175  2023-01-04     156.250000
4     250  2023-01-05     175.000000
5     300  2023-01-06     195.833333
6     225  2023-01-07     200.000000
7     210  2023-01-08     215.714286
8     250  2023-01-09     230.000000
9     300  2023-01-10     244.285714
10    600  2023-01-11     305.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

   Date
   
0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

Your function should create the following DataFrame:

   Date      Weekday
   
0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [41]:
import pandas as pd

In [42]:
df_date=pd.DataFrame({"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})

In [43]:
df_date

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [44]:
def add_weekday_column(df):
    df_date["Weekday"]=pd.to_datetime(df_date["Date"]).dt.day_name()
    return df

In [45]:
add_weekday_column(df_date)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [47]:
def find_date_between(df):
    df_between=df[df_date["Date"]>='2023-01-01']
    df_between[df_between["Date"]<='2023-01-31']
    
    return df

In [48]:
find_date_between(df_date)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

We need to first import pandas library so that we can get access of its functions.

----